[
    "bake",
    "barbecue",
    "baste",
    "beat",
    "blanch",
    "blend",
    "boil",
    "braise",
    "bread",
    "broil",
    "brown",
    "butter",
    "caramelize",
    "char",
    "chill",
    "chop",
    "clarify",
    "coat",
    "combine",
    "core",
    "cream",
    "crisp",
    "crush",
    "cure",
    "cut",
    "debone",
    "deglaze",
    "dehydrate",
    "descale",
    "dice",
    "dissolve",
    "distill",
    "drain",
    "dredge",
    "dress",
    "drizzle",
    "dry",
    "dust",
    "emulsify",
    "ferment",
    "fillet",
    "flambé",
    "fold",
    "freeze",
    "french",
    "frost",
    "froth",
    "fry",
    "garnish",
    "glaze",
    "grate",
    "grill",
    "grind",
    "halve",
    "heat",
    "hydrate",
    "infuse",
    "julienne",
    "knead",
    "ladle",
    "layer",
    "leaven",
    "marinate",
    "mash",
    "melt",
    "microwave",
    "mince",
    "mix",
    "mold",
    "panfry",
    "parboil",
    "pasteurize",
    "peel",
    "pickle",
    "pit",
    "poach",
    "portion",
    "pour",
    "precook",
    "preheat",
    "preserve",
    "pressure-cook",
    "prick",
    "puree",
    "reduce",
    "refrigerate",
    "render",
    "rest",
    "roast",
    "roll",
    "salt",
    "saute",
    "scald",
    "scorch",
    "score",
    "scramble",
    "sear",
    "season",
    "separate",
    "set",
    "shave",
    "shell",
    "shred",
    "sieve",
    "sift",
    "simmer",
    "skewer",
    "skim",
    "slice",
    "smoke",
    "soak",
    "sous-vide",
    "spatchcock",
    "spoon",
    "spread",
    "sprinkle",
    "steam",
    "steep",
    "stew",
    "stir",
    "strain",
    "stuff",
    "sugar",
    "temper",
    "tenderize",
    "thicken",
    "thin",
    "toast",
    "top",
    "torch",
    "toss",
    "trim",
    "truss",
    "turn",
    "tweak",
    "vacuum-seal",
    "wash",
    "weigh",
    "whip",
    "whisk",
    "zest",
    "carve",
    "crumble",
    "cube",
    "devein",
    "dip",
    "dock",
    "dot",
    "draw",
    "egg-wash",
    "fillet",
    "flake",
    "flip",
    "fold",
    "gloss",
    "hydrate",
    "hull",
    "joint",
    "macerate",
    "milk",
    "nick",
    "oil",
    "overlay",
    "parch",
    "paste",
    "pierce",
    "pipe",
    "pound",
    "probe",
    "proof",
    "reconstitute",
    "refresh",
    "reheat",
    "rice",
    "rub",
    "sauté",
    "scallop",
    "shuck",
    "silk",
    "singe",
    "slake",
    "slather",
    "smother",
    "snap",
    "sponge",
    "steep",
    "stew",
    "strew",
    "sublimate",
    "suction",
    "sweat",
    "syrup",
    "temper",
    "tender",
    "thread",
    "thunk",
    "twist",
    "unmold",
    "velveting",
    "warm",
    "water-bath",
    "wilt",
    "wrap",
    "use",
    "serve"
]